{"University Name":{"0":"Massachusetts Institute of Technology (MIT)","1":"University of Cambridge","2":"Stanford University","3":"University of Oxford","4":"Harvard University","5":"California Institute of Technology (Caltech)","6":"Imperial College London","7":"UCL","8":"ETH Zurich","9":"University of Chicago","10":"National University of Singapore (NUS)","11":"Peking University","12":"University of Pennsylvania","13":"Tsinghua University","14":"The University of Edinburgh","15":"EPFL","16":"Princeton University","17":"Yale University","18":"Nanyang Technological University, Singapore (NTU)","19":"Cornell University","20":"The University of Hong Kong","21":"Columbia University","22":"The University of Tokyo","23":"Johns Hopkins University","24":"University of Michigan-Ann Arbor","25":"Université PSL","26":"University of California, Berkeley (UCB)","27":"The University of Manchester","28":"Seoul National University","29":"Australian National University (ANU)"},"University Rank":{"0":"1","1":"2","2":"3","3":"4","4":"5","5":"6","6":"6","7":"8","8":"9","9":"10","10":"11","11":"12","12":"13","13":"14","14":"15","15":"16","16":"16","17":"18","18":"19","19":"20","20":"21","21":"22","22":"23","23":"24","24":"25","25":"26","26":"27","27":"28","28":"29","29":"30"},"University Score":{"0":"100","1":"98.8","2":"98.5","3":"98.4","4":"97.6","5":"97","6":"97","7":"95","8":"93.6","9":"93.2","10":"92.7","11":"91.3","12":"90.6","13":"90.1","14":"89.5","15":"89.2","16":"89.2","17":"89","18":"88.4","19":"87.2","20":"87","21":"86.7","22":"85.3","23":"85.1","24":"84.4","25":"83.8","26":"82.7","27":"82.3","28":"82.2","29":"82.1"},"University Location":{"0":"Cambridge, United States","1":"Cambridge, United Kingdom","2":"Stanford, United States","3":"Oxford, United Kingdom","4":"Cambridge, United States","5":"Pasadena, United States","6":"London, United Kingdom","7":"London, United Kingdom","8":"Zürich, Switzerland","9":"Chicago, United States","10":"Singapore, Singapore","11":"Beijing, China (Mainland)","12":"Philadelphia, United States","13":"Beijing, China (Mainland)","14":"Edinburgh, United Kingdom","15":"Lausanne, Switzerland","16":"Princeton, United States","17":"New Haven, United States","18":"Singapore, Singapore","19":"Ithaca, United States","20":" Hong Kong SAR","21":"New York City, United States","22":"Tokyo, Japan","23":"Baltimore, United States","24":"Ann Arbor, United States","25":"Paris, France","26":"Berkeley, United States","27":"Manchester, United Kingdom","28":"Seoul, South Korea","29":"Canberra, Australia"},"Details":{"0":"COVID-19 Information:MIT has cancelled information sessions and tours for prospective students. The on-campus admissions office is also closed indefinitely, although they are still answering emails and phone calls. The university has assured students whose education has been interrupted by COVID-19 that they will not be penalized in the admissions process.MIT will also not host or sponsor any in-person K-12 student programming through the summer of 2020. Instead, efforts are being made to ensure students and their families can learn everything they need to about campus through some kind of online delivery system.“Mind and Hand” is the thought-provoking motto of the Massachusetts Institute of Technology, known also as MIT. This motto enigmatically encapsulates this famous institution’s mission to advance knowledge in science, technology and areas of scholarship that can help to make the world a better place. At its founding in 1861, MIT was initially a small community of problem-solvers and science lovers eager to bring their knowledge to bear on the world. Today, MIT has evolved into an educational behemoth, with some 1,000 faculty members and more than 11,000 undergraduate and graduate students. MIT is now an independent, coeducational, privately endowed university organized into five schools (architecture and planning; engineering; humanities, arts, and social sciences; management; science). Yet the principle of educational innovation remains at the core of MIT’s educational philosophy. MIT researchers are at the forefront of developments in artificial intelligence, climate adaptation, HIV, cancer, and poverty alleviation, while in the past MIT research has fuelled scientific breakthroughs such as the development of radar, the invention of magnetic core memory and the concept of the expanding universe. Science and technology are not the only strings to MIT’s bow, however. Approximately 20 percent of MIT undergraduates join a sports team, and with 33 varsity sports MIT boasts one of the broadest intercollegiate athletic programs in the world. A vibrant arts culture also permeates college life. There are 12 museums and galleries on campus, with the MIT Museum drawing nearly 125,000 visitors each year. Students participate in more than 60 music, theatre, writing and dance groups, and faculty members of MIT even include Pulitzer Prize winners and Guggenheim fellows.MIT is set in 168 acres of grounds that extend for more than a mile along the Cambridge side of the Charles River basin. The campus features stunning landmarks designed by the likes of architects Alvar Aalto, Frank Gehry, and Steven Hollin, as well as buildings in a range of architectural styles, from neoclassical to modernist and brutalist. At its edges, the campus merges with various Cambridge neighborhoods, including Kendall Square which is one of the most innovative square miles on the planet. The close association of industry and research has helped MIT alumni go on to launch more than 30,000 active companies, creating 4.6 million jobs and generating roughly $1.9 trillion in annual revenue. No wonder then that a nation of MIT graduates would be equivalent to the 10th-largest economy in the world.","1":"COVID-19 Information:UK students with an offer from the University of Cambridge are advised to wait for further information from the university. The university is working hard to minimize the impact on admissions and is consulting with UCAS and other bodies, while waiting for further government advice.International students who must take an English-language test should check for updates on when IELTS and TOEFL test centers will reopen.All offer holders are instructed to keep a log of any disruption they experience, so the university can treat all candidates equitably. Students are not required to send this information now, but may be asked to provide it in the future.All events and open days have been cancelled until further notice.Located in the center of the ancient city of Cambridge, 50 miles north of London, the University of Cambridge is a collegiate public research institution that serves more than 18,000 students from all corners of the globe. The university consists of numerous listed buildings and is divided into 31 autonomous colleges, with many of the older ones situated on the famous river Cam. Applications are made directly to the individual colleges, rather than to the university overall. You can live and are often taught within your college, receiving small group teaching sessions known as college supervisions. Six academic schools – Arts and Humanities, Biological Sciences, Clinical Medicine, Humanities and Social Sciences, Physical Sciences, and Technology – are spread across the university’s colleges, housing roughly 150 faculties and other institutions. Founded in 1209, the University of Cambridge’s 800-year history makes it the fourth-oldest university in the world and the second-oldest university in the English-speaking world. Cambridge students make up 20 percent of the town's population and most of the older colleges are situated near the city center. Its notable buildings give the city of Cambridge a unique character, and include King's College Chapel, the history faculty building designed by James Stirling and the Cripps Building at St John's College.Cambridge is widely acknowledged as a vibrant place to be a student. On the academic side, the university is home to over 100 libraries, which hold more than 15 million books in total. There are also nine world-renowned arts, scientific and cultural museums such as Kettle’s Yard and the Fitzwilliam Museum, which are open to the public throughout the year, as well as a botanical garden. Extracurricular activities give you the chance to get involved with anything from the university’s renowned student drama societies, which spawned the likes of comedy group Monty Python, to music, politics and hundreds of other clubs and societies. The sports scene at Cambridge is huge too, with state-of-the-art facilities and over 80 sports on offer with teams for novices and experts alike. With its reputation for academic excellence and traditional scholarly values, the University of Cambridge often ranks among the very top universities in the world for teaching, research, and international outlook. The university has educated eminent mathematicians, scientists, politicians, lawyers, philosophers, writers, actors and heads of state. Ninety-eight Nobel laureates and 15 British prime ministers have affiliations with Cambridge as students, faculty or alumni, including the scientists Francis Crick and Frederick Sanger.","2":"COVID-19 Information:The Stanford Office of Undergraduate Admission has been closed until further notice. Applications continue to be processed, however, and the office can be contacted via email. All tours, programs and information sessions for prospective students have been cancelled and the Visitor Center is also closed until further notice. Located 35 miles south of San Francisco and 20 miles north of San Jose, Stanford University is in the heart of Northern California’s dynamic Silicon Valley, home to Yahoo, Google, Hewlett-Packard, and many other cutting-edge tech companies that were founded by and continue to be led by Stanford alumni and faculty. Nicknamed the “billionaire factory”, it is said that if Stanford graduates formed their own country it would boast one of the world’s largest ten economies. Covering 8,180 acres, Stanford has one of the largest university campuses in the US, with 18 interdisciplinary research institutes and seven schools: the Graduate School of Business; School of Earth, Energy & Environmental Sciences; Graduate School of Education; School of Engineering; School of Humanities and Sciences; Law School; and School of Medicine. Stanford University was founded in 1885 by California senator Leland Stanford and his wife, Jane, to “promote the public welfare by exercising an influence in behalf of humanity and civilization”. The couple’s only child had died of typhoid, and their decision to build a university on their farm was intended as a memorial. From the start the university was non-sectarian, co-educational and affordable, teaching both the traditional liberal arts and the technology and engineering that was shaping the new America at the time.  Fast forward more than a century, and Stanford counts 19 Nobel laureates within its community and is regularly ranked among the top three universities in the world. Nicknamed “The Farm” from the days when horses roamed there, Stanford’s campus is now a thriving community of more than 11,000 creative and accomplished people from around the world. Nearly all undergraduate and 60 per cent of graduate students live on campus, so it is hardly surprising that student life is rich and diverse, with over 625 organized student groups. Sport is popular, with students, faculty and staff enjoying state-of-the-art recreational facilities and wellness programs. Stanford students compete in 36 varsity and 32 club sports, including baseball, football, basketball, and squash. Sports teams are referred to as the “Stanford Cardinal”.Stanford also has a rich tradition of fostering creativity and the arts: there is a vibrant campus arts district and two world-class museums which host regular exhibitions.  Eight dining halls, a teaching kitchen and organic gardens provide the campus community with healthy, sustainable meals. The close-knit communal nature of life on campus has even given rise to “Stanford speak”, a special language only spoken on campus.  ","3":"COVID-19 Information: \n\nAs UK schools have largely closed and exams will no longer be taking place, the University of Oxford is awaiting further information from the government on how qualifications (i.e. A-Levels) will be awarded. More information for both domestic and international offer-holders will be made available as soon as possible.Graduate applications are still being processed by the university - an online form has been provided on the university website for any queries. If you need to take an English-language test, the university currently has a deadline of the UK summer. If test centers around the world do not reopen in time, the university will provide further guidance on how to proceed.The University of Oxford is the oldest university in the English-speaking world, and is actually so ancient that its founding date is unknown – though it is thought that teaching took place there as early as the 11th century. It’s located in and around the medieval city center of Oxford, dubbed “the dreaming city of spires” by the 19th century poet Matthew Arnold, and comprises 44 colleges and halls as well as the largest library system in the UK. There are 22,000 students at Oxford in total, around half of whom are undergraduates, while 40 per cent are international students. A quarter of the city of Oxford’s residents are students, giving the city the youngest population in the UK. The University of Oxford does not have a main campus, its buildings and facilities instead being scattered around the medieval city center. Its colleges each have a distinctive character and traditions often dating back centuries. Colleges are self-governing institutions to which students usually apply directly. There are four academic divisions within Oxford University: Humanities, Mathematical, Physical and Life Sciences; Medical Sciences; and Social Sciences. The university’s particular strength is the sciences, and it is ranked number one in the world for medicine.Oxford is a youthful and cosmopolitan city with plenty to see and do. There are dozens of historic and iconic buildings, including the Bodleian Libraries, Ashmolean Museum, Sheldonian Theatre, the cathedral, and the colleges themselves. Students can choose to spend their time studying or avail themselves of the many extracurricular activities available. There’s a strong musical life at Oxford, with clubs and societies spanning all genres, from jazz, through to classical and folk. Oxford is also ranked highly for sport, with its top rowers taking part every year in the world-famous boat race with the University of Cambridge on the River Thames. Drama lovers are also well catered for, with one of the largest and most vibrant university drama scenes in the country.Oxford has an alumni network of over 250,000 individuals, including more than 120 Olympic medalists, 26 Nobel Prize winners, seven poets laureate, and over 30 modern world leaders (including Bill Clinton, Aung San Suu Kyi, Indira Ghandi and 26 UK Prime Ministers). It has a friendly rivalry with Cambridge for the title of best university in the UK and is regularly ranked as being one of the top three universities in the world. Notable Oxford thinkers and scientists include Tim Berners-Lee, Stephen Hawking and Richard Dawkins. ","4":"COVID-19 Information:\n\nInternational students that have been invited to study at Harvard University are advised to contact their academic department for more information. While the admissions office is closed, staff can be contacted by email and telephone. No information sessions or tours will be cancelled.Visitas - Harvard’s weekend for admitted students - is now being held virtually.Established in 1636, Harvard is the oldest higher education institution in the United States, and is widely regarded in terms of its influence, reputation, and academic pedigree as a leading university in not just the US but also the world. Located in Cambridge, Massachusetts, three miles north-west of Boston, Harvard’s 209-acre campus houses 10 degree-granting schools in addition to the Radcliffe Institute for Advanced Study, two theaters, and five museums. It is also home to the largest academic library system in the world, with 18 million volumes, 180,000 serial titles, an estimated 400 million manuscript items and 10 million photographs. Like most of the United States’ pre-Civil War colleges, Harvard was founded to train clergy, but Harvard’s curriculum and student body quickly secularized, and in the 20th century admissions policy was opened up to bring in a more diverse pool of applicants. Now, a total of 21,000 students attend the university, each of whom at some point can be seen bustling past the famous statue of John Harvard, the university’s first benefactor and founder, which looks on benignly in the center of the campus. The bronze statue’s gleaming foot is due to almost incessant rubbing by tourists and students, who believe the act brings good luck. Only the academic elite can claim a place at Harvard, and the nominal cost of attendance is high – though the university’s hefty endowment is such that it can offer generous financial aid packages, which around 60 per cent of students take advantage of. As freshmen, students live in one of the dormitories in Harvard Yard, a prime location, and eat in the historic and picturesque Annenberg dining hall. Harvard students are active around and beyond campus, with over 400 official student societies including extracurricular, co-curricular and athletic opportunities. Whether playing on the field in Harvard Stadium, fostering entrepreneurial activities at the Harvard innovation lab or writing and editing at the daily newspaper the Harvard Crimson, student life is a rich and rewarding experience. Harvard\\'s alumni include eight US presidents, several foreign heads of state, 62 living billionaires, 359 Rhodes Scholars, and 242 Marshall Scholars. Whether it be Pulitzer Prizes, Nobel Prizes, or Academy Awards, Harvard graduates have won them. Students and alumni have also won 108 Olympic medals between them. The university is regularly ranked number one in the world, and the consistency of its chart-topping performances shows that success is yet to breed complacency. ","5":"COVID-19 Information:\n\nCaltech is continuing to accept international students, although all arrivals at the university will have to initially follow self-quarantine guidelines that apply to all travellers. All admission-related campus visit activities have been suspended until further notice.The California Institute of Technology (Caltech) is a world-renowned science and engineering research and education institution, located in Pasadena, California, around 11 miles northeast of downtown Los Angeles. Caltech has a high research output as well as many high-quality facilities such as the Jet Propulsion Laboratory (owned by NASA), the Caltech Seismological Laboratory, and the International Observatory Network.  It’s among a small group of institutes of technology in the United States primarily devoted to teaching technical arts and applied sciences, and its fiercely competitive admissions process ensures only a small number of the most gifted students are admitted.The university was founded as a preparatory and vocational school by Amos G. Throop in 1891, with the mission “to expand human knowledge and benefit society through research integrated with education”. It became a major hub of US scientific research in the early 20th century and was instrumental to the United States’ war effort during World War II. Today, it is home to the Einstein Papers Project, an initiative seeking to preserve, translate and publish selected papers from the estate of Albert Einstein. It has also established an energy innovation hub that aims to discovery revolutionary methods of generating fuels directly from sunlight. Caltech’s 124-acre campus is within walking distance of Old Town Pasadena and the Pasadena Playhouse District, and the two locations are frequent getaways for students. Life on campus is rich with social activities, clubs, associations and recreational facilities. Intercollegiate sport is taken very seriously, with the Caltech Beavers (the beaver – nature’s engineer – is the college’s mascot) competing in 13 intercollegiate sports. Caltech also offers excellent opportunities for the study and performance of music, theater, and the visual arts, all activities that play a vital role in realizing Caltech’s mission to role in realizing the Institute's mission of \"educating outstanding students to become creative members of society\". Providing a touch of grandeur, the Athenaeum is a stately building in the center of the campus where members can go for formal and informal dining, meetings, rendezvous and private parties. The balance at Caltech between a rigorous academic curriculum and activities that promote personal development ensures time spent there for students is both formative and an invaluable staging post to a successful career.  Although it may lack the reputation of Ivy League universities or the likes of Oxford and Cambridge, Caltech is undoubtedly one of the best universities in the world, a fact reflected in all the university rankings, which regularly single out technology and engineering as the school’s key academic strengths. ","6":"COVID-19 Information:  https:\/\/www.imperial.ac.uk\/study\/covid-19\/. Ranked 7th in the world in the QS World University Rankings® 2022, Imperial College London is a one-of-a-kind institution in the UK, focusing solely on science, engineering, medicine and business. Imperial offers an education that is research-led, exposing you to real world challenges with no easy answers, teaching that opens everything up to question and opportunities to work across multi-cultural, multi-national teams.Imperial is based in South Kensington in London, in an area known as ‘Albertopolis’, Prince Albert and Sir Henry Cole’s 19th century vision for an area where science and the arts would come together. As a result, Imperial’s neighbours include a number of world leading cultural organizations including the Science, Natural History and Victoria and Albert museums; the Royal Colleges of Art and Music; and the Royal Albert Hall, where all of their students also graduate.\n\nThere is plenty of green space too, including two Royal Parks (Hyde Park and Kensington Gardens) within 10 minutes’ walk of campus. Travel to and from the area is also really easy as it’s served by three Tube lines and many bus routes.\n\nOne of the most distinctive elements of an Imperial education is that students join a community of world-class researchers. The cutting edge and globally influential nature of this research is what Imperial is best known for. It’s the focus on the practical application of their research – particularly in addressing global challenges – and the high level of interdisciplinary collaboration that makes their research so effective. Read more about their research impact on their research and innovation webpages.\n\nThe number of award winners, Nobel Prize holders and prestigious Fellowships (Royal Society, Royal Academy of Engineering, Academy of Medical Sciences) amongst their staff is a testament to the outstanding contributions they have made in their respective fields.\n\nImperial is one of the most international universities in the world, with 59% of its student body in 2019-20 being non-UK citizens and more than 140 countries are currently represented on campus. Meanwhile, the College’s staff, like their students, are diverse in their cultural backgrounds, nationalities and experiences.Follow Imperial on Facebook, Twitter, Instagram, and Snapchat (just search \"imperial college\").","7":"For information on COVID-19 please visit: https:\/\/www.ucl.ac.uk\/coronavirus\/Where novel thinking is nurtured and encouragedUCL is a diverse community with the freedom to challenge, to question, and to think differently. Our community pursues academic excellence, breaks boundaries and makes a positive impact on real world problems.An Academic PowerhouseUCL is 8th in the world in the “QS World University Rankings 2022.”  There have been 30 Nobel laureates among its former staff and students; a winner in every decade since the Prize started.World Leading Research UniversityAt the very heart of UCL’s mission is our research. We were rated the top university in the UK for research strength in the last Research Excellence Framework (REF 2014). We offer over 675 postgraduate taught, research and initial teacher education programmes across a wide range of disciplines, and encourage our community to work across traditional subject boundaries. UCL's research-based teaching methodology means that research is integrated into many of our degrees and students have the opportunity to make an original contribution to their field of study. London’s Global UniversityUCL sits at the heart of one of the world’s most dynamic cities, meaning you are perfectly placed to take advantage of everything London has to offer. We were the first university in England to welcome women to university education, and the first university in England to welcome students of any religion or social background. UCL has 18,000 students from outside the UK, with over 150 countries represented, providing a truly global perspective.Your FutureUCL has been ranked among the top 20 universities worldwide for graduate employability in the 2022 QS Graduate Employability Rankings. At UCL we know that students choose to enter graduate study for a myriad of reasons, and we are deeply committed to supporting our student’s aspirations and enhancing their skills and employability. UCL Careers helps students to find their perfect career, develop their professional skills or start their own business through one-to-one guidance and events, as well as a variety of careers information. Recruitment and networking events help students improve their knowledge of a particular industry sector and specific employers. For students interested in starting a business, UCL Innovation and Enterprise gives expert advice and practical support, as well as networking opportunities.Study Climate Change at UCL A UCL education is a climate education. UCL students have the opportunity to delve into climate issues and make an impact through many of UCL's programmes of study. Our students bring new thinking on climate action; from designing solutions to UCL's climate challenges through the Living Lab programme to helping us implement the changes as Sustainability Ambassadors  and holding us to account at the UK’s first Student Sustainability Council.    Find out more about UCL courses and modules with a climate change focus or element.Generation One UCL is turning ground-breaking science and ideas into actions to tackle climate change.   Inspired by the words of former US President, Barack Obama: “We are the first generation to feel the effect of climate change, and the last generation who can do something about it.” Generation One offers everyone the chance to understand the science behind the issues facing our planet. UCL is driving debate and solutions, empowering everyone to feel they can contribute, rather than being overwhelmed by the challenge. Find out more and pledge your action.  Connect with us:Follow us on InstagramFind us on FacebookFollow us on TwitterConnect with us on LnkedIn","8":"For COVID-19 information please visit: https:\/\/ethz.ch\/services\/en\/news-and-events\/coronavirus.htmlETH Zurich is one of the world's leading universities in science and technology and is known for its cutting-edge research and innovation. It was established in 1855 as the Swiss Federal Polytechnic School, and a century and a half later the university can count 21 Nobel laureates, 2 Fields Medalists, 3 Pritzker Prize winners, and 1 Turing Award winner as alumni, including the great Albert Einstein himself.The university, officially called the Swiss Federal Institute of Technology Zurich in English, has 16 departments that offer academic education and conduct scientific research in subjects ranging from engineering and architecture to chemistry and physics.Education at ETH Zurich combines solid theory with practical application, and most degree programs build on strong mathematical foundations. For undergraduates the main teaching language is German, while most master's programs and doctoral studies are in English.Located in Zurich, Switzerland's largest city, ETH Zurich has two main locations: in downtown Zurich and on a modern campus built on a hill in the outskirts of the town. Students at ETH face an intensive workload, but they can still find time for cultural and other leisure activities and for attending the many regular symposia and conferences on campus, where some of the best minds in science come to speak.ETH students like to exercise their bodies as well as their minds, and there is a wealth of various sports on offer on campus. The largest annual event is the SOLA relay race , taking place in 14 sections over a total distance of 140 kilometers. More than 900 teams have been known to take part at once in the annual spectacle.Since the 1880s, students have also been able to show off their best moves at the Polyball, a classic ball event, featuring live music by several orchestras and bands. Every November, 10,000 dancers, music-lovers and partygoers descend on ETH’s extensively decorated main building for what is usually an unforgettable night. ","9":"","10":"A leading global university centred in Asia, the National University of Singapore (NUS) is Singapore’s flagship university, which offers a global approach to education and research, with a focus on Asian perspectives and expertise.NUS has 17 faculties and schools across three campuses. Its transformative education includes a broad-based curriculum underscored by multi-disciplinary courses and cross-faculty enrichment. Over 38,000 students from 100 countries enrich the community with their diverse social and cultural perspectives. NUS also strives to create a supportive and innovative environment to promote creative enterprise within its community.The 17 Schools in NUS include:  NUS takes an integrated and multi-disciplinary approach to research, working with partners from industry, government and academia, to address crucial and complex issues relevant to Asia and the world. Researchers in NUS’ Schools and Faculties, 30 university-level research institutes and centres, and Research Centres of Excellence cover a wide range of themes including: energy, environmental and urban sustainability; treatment and prevention of diseases common among Asians; active ageing; advanced materials; risk management and resilience of financial systems. The University’s latest research focus is to use data sciences, optimisation research and cyber security to support Singapore's Smart Nation initiative.For more information on NUS, please visit http:\/\/www.nus.edu.sg\/","11":"COVID-19 Information:Peking University has extended the deadline for submitting hard copies of documents for international students applying to study in 2020 at undergraduate level. Any students who cannot meet the new deadline are advised to contact the university.The oldest higher education institution in China, Peking University was founded in 1898 as a replacement for the ancient Guozijian school (Imperial College). By the early 1920s, it had become a center for Chinese progressive thought, playing an important role in China's New Culture Movement, the May Fourth Movement, and the Tiananmen Square protest of 1989, among other significant historical events. Peking University has been consistently ranked as the top academic institution in China. As well as being renowned academically, it’s well-known for its stunning campus grounds and for the beauty of its traditional Chinese architecture. Peking University has educated some of the most prominent figures in Chinese history, including Mao Zedong. The main university campus is in the former site of the Qing Dynasty imperial gardens and as such features traditional Chinese-style landscaping, including traditional houses, gardens, pagodas, as well as many notable historical buildings and structures. Weiming Lake is to the north of the campus and is surrounded by walking paths and small gardens. The university grounds are also home to museums, such as the Museum of University History and the Arthur M. Sackler Museum of Art and Archaeology, in which students can view objects dating back thousands of years. It’s an environment to feed the enquiring minds of young students – not that the academic curriculum doesn’t already do that. Peking University is a leading university for science research and teaching and has successfully developed applied sciences research and teaching as well. There are 30 colleges and 12 departments, with 93 undergraduate programs, 199 master's degree programs, and 173 options for doctoral candidates. Peking is eager for students to receive not only comprehensive education, but to take part in student life to the full.  Life on campus is rich with sport and extracurricular fare, with more than 200 student organizations and a range of activities running year-round. Sport is important, with Beida Cup Athletic Championships taking place each year, while festivals and events such as the International Cultural Festival, or Singing Competition for Foreign Students, allow students to meet up, make friends and enjoy a balanced life outside of their studies. ","12":"COVID-19 Information:All on-campus visits for prospective students at the University of Pennsylvania have been cancelled. The Admissions Visitor Center is also closed during this time. Students can still explore the campus in a virtual tour.The University of Pennsylvania is a private Ivy League research university located in the city of Philadelphia. It was founded in 1740 by Benjamin Franklin, one of the United States’ founding fathers, who was eager to create a school to educate future generations. Franklin advocated a concept of higher education that focused not merely on the education of the clergy, but on teaching knowledge of arts and humanities, as well as the practical skills needed to make a living and to do public good. His maxim of “well done is better than well said” lives on today through its commitment to inclusive policies and innovation. As of fall 2017, there were 21,599 students studying at Penn, split equally between undergraduate and graduate students. Penn has a strong focus on interdisciplinary learning and research, offering double degree programs, unique majors and academic flexibility. This means competition to study at Penn is fierce, particularly at undergraduate level. The admission rate for the class of 2021 was 9.3 percent, of which 46 percent were either black, Hispanic Asian, or Native American. Unusually for an Ivy League school, women comprise over half (54 percent) of all students enrolled.  Penn’s core campus covers more than 279 acres in a contiguous area of West Philadelphia's University City. All of Penn's schools and most of its research institutes are located on this campus, with the surrounding neighborhood including restaurants and pubs, a large supermarket and cinema. Student life at Penn serves up opportunities to discover new interests and passions galore, through a wide diversity of social, political, religious, and cultural activities. There are cultural centers and one-of-a-kind museums on campus that allow the arts to play a leading role in student life such as the Annenberg Center for the Performing Arts, the Arthur Ross Gallery, and Institute of Contemporary Art, which are all major cultural destinations and easy for Penn students to access. The university also takes sports and recreation very seriously, with students taking part in ice hockey, athletics and joining a variety of competitive, instructional and recreational sports clubs.  With its arts and sciences programs ranking in the top 10 nationally, and the employment prospects for its students among the brightest (Penn boasts one of the highest numbers of graduates who go on to become Fortune 500 CEOs), there is little doubt that the University of Pennsylvania deserves its Ivy League status and reputation.  ","13":"Students looking for great engineering and computer science programs need look no further than Tsinghua University in Beijing, which since 2015 has been ranked as one of the best in the world for both disciplines. Tsinghua University was established in 1911 in the wake of the anti-colonialist Boxer Rebellion, which saw the US fine China $30m as punishment. In 1909, President Theodore Roosevelt negotiated with Congress a reduction in the sum, with the leftover money earmarked for university scholarships for Chinese students to study in the US. Tsinghua University was established as a preparatory school for the students’ trips abroad. Today, Tsinghua’s motto of “self-discipline and excellence” has taken it far. Most university rankings place Tsinghua among the best universities in China, and famous alumni include President Xi Jinping himself, who graduated with a degree in chemical engineering in 1979. Tony Blair, Henry Kissinger, and Bill Clinton are among the distinguished guests who have spoken at Tsinghua. The university is academically organized into 20 schools and 57 departments covering a broad range of subjects, including science, engineering, arts and literature, social sciences, medicine. Xinya College was established in 2014 as the school’s residential liberal arts college as part of a series of reforms to undergraduate education. Unlike other Tsinghua students who must choose a specific major upon enrollment, Xinya students can declare their majors at the end of their freshman year.The campus of Tsinghua University is located in northwest Beijing, in the Haidian district, on the former site of the Qing Dynasty royal gardens. As such it retains Chinese-style landscaping as well as traditional buildings, although many of its buildings are also western in style, reflecting its American heritage. Like its archrival Peking, Tsinghua is known for having one of the most beautiful university campuses. On campus, students keep themselves occupied with more than just academic study (although the heavy workloads mean studying is always a priority). There are more than 110 student clubs and associations covering interests such as science and technology, health and fitness, humanities, arts and public welfare. Overseas students are particularly encouraged to join in the fun, with a host of extracurricular such as welcome parties, New Year’s parties, graduation parties, and visits to cultural and historical landmarks. ","14":"Inspiring the world since 1583The University of Edinburgh is one of the world's top universities, consistently ranked in the world top 50*, and placed 15th in the 2023 QS World University Rankings. Our entrepreneurial and cross-disciplinary culture attracts students and staff from across the globe, creating a unique Edinburgh experience. We provide a stimulating working, learning and teaching environment with access to excellent facilities. We attract the world's best, from Nobel Prize winning laureates to future explorers, pioneers and inventors.Study with usAs host to more than 45,000 students from some 156 countries, the University of Edinburgh continues to attract the world’s greatest minds.We offer a range of ways to study, from on-campus taught programmes to online part-time study. We are the largest provider of online distance learning in the Russell Group of UK research-intensive universities, and offer more than 70 online programmes. Our flexible and supportive online learning programmes are an increasingly popular choice for students looking to balance further study with professional or family commitments.Teaching and research excellenceThe latest report from the Quality Assurance Agency awarded us the highest rating possible for the quality of the student learning experience. At postgraduate level, we offer more than 300 taught masters courses and 180 research areas across our three Colleges:- College of Arts, Humanities and Social Science \n- College of Medicine and Veterinary Medicine\n- College of Science and EngineeringOur position as one of Britain’s leading research universities was reaffirmed by the results of the 2021 Research Excellence Framework (REF). The REF rates 90% of our research activity as world-leading or internationally excellent, ranking us fourth in the UK based on the quality and breadth of our research.We are associated with 19 Nobel Prize winners, who are alumni of the University of have been members of academic staff here and have long enjoyed a spirit of innovation and collaboration and continue to do so today. We are proudly open to everyone, bringing people with new outlooks and perspectives together in an international community that is establishing the data capital of Europe, tackling climate change and paving the way for new fertility treatments. Our scientists are seeking cures for cancer, repurposing drugs to improve treatments for the Covid-19 Coronavirus and contributing to the global search for a vaccine.Joining the University as a student provides you with a unique opportunity to work with some of the most influential academics in your chosen field. At Edinburgh, you will develop specialist skills, deepen your understanding and gain new insights and perspectives to equip you for your career ahead.Global connectionsOur ambitious internationalisation strategy aims to provide world-class experiences for students and ensures the teaching and research we deliver offers global benefits.Collaborations and international partnershipsWe collaborate with a host of world-leading institutions in fields as diverse as e-science, engineering, life and medical sciences and arts and culture. We’re also a member of the global research network Universitas 21, and the European networks COIMBRA group, as well as UNICA, LERU, and UNA EuropaOur students are crucial to our continued success and development and, along with our staff, they forge research links through regular travel and overseas exchanges. We take pride in our partnerships with other institutions such as the California Institute of Technology, University of Copenhagen, University College Dublin, the University of Melbourne, Peking University, the University of Delhi and Zhejiang University– to name but a few.AlumniAs a graduate of Edinburgh, you will join a lifelong community of more than 200,000 like-minded people from across the world. This professional and social network provides a lifetime of support with clubs and contacts across the world and a range of groups and resources online. For a taste of what our alumni are doing today, see our monthly update where they share their experiences, showcase their career paths, and impart their wisdom.Visit our alumni pages for more details.FeesTuition fees vary by programme and length taken to complete. Visit our tuition fees pages for more information.Funding and scholarshipsPostgraduate study can be a significant financial commitment; however, the range of funding sources available may surprise you. We offer several postgraduate scholarships and studentships to outstanding candidates. Check our scholarship pages for details.(*Times Higher Education World Rankings)","15":"COVID-19 Information:All EPFL buildings remain closed until further notice. Classes are being held online and nobody is permitted to bring visitors to campus.The École polytechnique fédérale de Lausanne (EPFL) is a research institute and university in Lausanne, Switzerland, specializing in the natural sciences and engineering. Its roots can be traced back to the foundation of a private school in 1853, which to start with only had 11 students. Those days are long gone though, with the modern day EPFL one of two Swiss Federal Institutes of Technology and student numbers in Lausanne now totaling over 10,000. Located in the French-speaking part of Switzerland, EPFL is twinned with the Swiss Federal Institute of Technology in Zurich (ETH Zurich). As part of its research and teaching activities, EPFL is one of the only universities to run a nuclear reactor, a fusion reactor, a Gene\/Q Supercomputer, and have P3 bio-hazard facilities.EPFL has a very singular admissions process, which, for would-be undergraduates who are Swiss nationals, is not selective at all. At the end of freshman year, however, a block exam determines whether students can continue or have to repeat the year, with many home students dropping out entirely at this point. The EPFL campus lies on the shores of Lake Geneva and consists of 65 buildings across 136 acres. Facilities include banks, bars, two museums – the Musee Bolo and Archizoom – as well as bars, restaurants and cafeterias. There are students of 112 different nationalities here, though as of 2014 women made up only 27 percent of the student body. Life on campus is vibrant, with many student-formed clubs and associations providing social and recreational opportunities. A wide range of sports and leisure facilities keep students physically active while studying. EPFL also has an active student media, publishing the monthly newspaper Flash and there are daily broadcasts on the student radio station. Another priority on campus is the arts, with the university holding several annual music festivals each year. The largest is Balélec Festival, where 15,000 visitors descend upon the university to watch 30 concerts on two outdoor and four indoor stages.","16":"COVID-19 Information:Princeton University lectures and classes are now all being taught online. Applicants will not be able to visit the university in person.Princeton is one of the oldest and most prestigious universities in the United States. It was founded in 1746 and moved to its current site in New Jersey in 1896. Princeton is renowned for the spectacular greenery of its campus and for the architectural splendor of some of its landmark buildings, such as its Lewis Library, which was designed by Frank Gehry. Its student body is relatively small, with fewer than 10,000 enrolled in total, and international students make up 12 per cent of undergraduates. Princeton is one of the world’s foremost research universities, and has educated two US presidents, James Madison and Woodrow Wilson. Other distinguished graduates include Michelle Obama, actors Jimmy Stewart and David Duchovny, Google chairman Eric Schmidt and Apollo astronaut Pete Conrad.Princeton was founded by New Light Presbyterians to provide training to its ministers. After the American Civil War, the college expanded, and its curriculum was overhauled. Around the turn of the 20th century, it officially became a university and its famous graduate school opened. Today’s Princeton provides undergraduate and graduate education in the humanities, social sciences, natural sciences, and engineering as well as offering a number of professional degrees. Princeton’s main campus is spread across 500 acres and has around 180 buildings, including 10 libraries. The main campus was named one of the most beautiful in the United States by New York’s Travel+Leisure magazine. Most Princeton students live, eat, study, work, and are at leisure on campus.  The Ivy League institution guarantees accommodation to all of its undergraduate students across the four years of their degree and is committed to building a diverse campus community. Residential colleges offer a variety of academic, social, cultural and recreational programs, and opportunities abound for students to engage in interests beyond their academic study, whether that be writing for a literary publication, learning the science of beekeeping, or singing with an a capella group. The university is within easy reach of both New York City and Philadelphia, with the “Dinky” shuttle train providing a regular one-hour service to both cities. Studying at Princeton surrounded by natural beauty and architectural gems brings the best out in students. Several alumni and faculty members have been awarded Nobel prizes, and the university is consistently ranked in the top ten worldwide. Admissions are need-blind and, through a combination of grants and college jobs, few students graduate in debt – even though 60 percent of incoming students receive financial aid. ","17":"COVID-19 Information:Visitors to the Yale University campus are being asked to come only if it is essential. Classes are being taught online.Yale University is a private research university and a member of the prestigious Ivy League, a group of America’s most celebrated higher education institutions. Situated in New Haven, Connecticut, the first planned city in America, Yale was founded by English Puritans in 1701, making it the third-oldest higher education institution in the United States. Today, the city, which is part of the New York metropolitan area, is very much dominated by Yale, though it’s also billed as the “Cultural Capital of Connecticut”. According to the New York Times, New Haven is also extremely picturesque, with “art almost everywhere you look”.Yale University’s central campus spans 260 acres and includes buildings from the mid-18th century. The university is organized into 14 schools: the original undergraduate college, the Yale Graduate School of Arts and Sciences and 12 professional schools. Undergraduates follow a liberal arts curriculum which allows you to think and learn across disciplines before deciding upon a major. Perhaps its most distinctive feature, Yale undergraduates are organized into a social system of residential colleges, which allows them to experience the cohesiveness and intimacy of a small school while still enjoying the cultural and scholarly resources of a large university.A recently unveiled portrait of Barack Obama was by a Yale alumnus, and strolling across the Yale campus, you’ll find that you’re surrounded by public art. Be it in courtyards or plazas, lobbies or lecture halls, art at Yale inspires reflection and offers aesthetic pleasure. College life is similarly rich, reflecting the diversity of cultures and nationalities on campus. There’s always a packed arts calendar which includes exhibitions at world-class museums and galleries. There’s also a Tony Award-winning theater, Yale Cabaret – a theater-restaurant run by students – and hundreds of student groups, ranging from the serious to the silly. On top of this, you’ll also find the usual array of top quality sports facilities, a golf course and centers for tennis, polo, sailing, ice hockey, and more as well as competitive sports, with over 30 men’s and women’s varsity teams. To study at Yale is to join great company: four Yale graduates signed the American Declaration of Independence, and the university has educated five US presidents: William Howard Taft, Gerald Ford, George H. W. Bush, Bill Clinton and George W. Bush. It is rightly regarded as one of America and the world’s most prestigious universities, with competition to be admitted as fierce as it gets. ","18":"COVID-19 Information:The university has asked for tour groups and other visits to the campus be suspended until further notice. All international arrivals at the university must follow the self-quarantine guidelines that apply to all of Singapore.Young and research-intensive, Nanyang Technological University, Singapore (NTU Singapore) is placed 11th globally, and 1st among the world’s best young universities for five consecutive years (QS university rankings).\n \nHome to 33,000 students, NTU offers engineering, science, business, humanities, arts, social sciences, and education, and has a joint medical school with Imperial College London.\n \nRanked the top university in the world for citations in artificial intelligence (Nikkei and Elsevier 2017) for the period 2012-2016, NTU is embracing digital technologies for better learning and living as part of its Smart Campus vision. It has partnerships with the world’s leading technology companies such as Alibaba, Rolls-Royce, BMW, Volvo, Delta Electronics, and Singtel in many areas of societal importance and impact that include artificial intelligence, data science, robotics, smart transportation, computing, personalised medicine, healthcare and clean energy.\n \nThe NTU Smart Campus is not only a living testbed of tomorrow’s technologies, but it is also frequently listed among the world’s Top 15 most beautiful university campuses. It has 57 Green Mark-certified (equivalent to LEED-certified) building projects comprising more than 230 buildings, of which 95% are certified Green Mark Platinum.\n \nApart from its main campus, NTU also has a medical campus in Novena, Singapore’s healthcare district.","19":"COVID-19 Information:Cornell University’s Ithaca campus is largely closed, with only students living in on-campus accommodation allowed to be present. All teaching has moved online. Applicants will not be able to visit the university in person.\"I would found an institution where any person can find instruction in any study,” is the motto of Cornell University, words first uttered by its co-founder Ezra Cornell. Cornell was founded in 1865 with the then radical intention of teaching and making contributions in all fields of knowledge. Since its founding, Cornell has been a co-educational, non-sectarian institution where admission has not been restricted by religion or race. These are liberal traditions that Cornell holds dear: a recent article in the Cornell Chronicle heralded the first all-female class admitted to its famous Farrier program in veterinary science. Cornell was also the first university to offer degrees in journalism and the first to teach modern Far Eastern languages. The main campus of Cornell is on East Hill in Ithaca, New York, overlooking the city and Cayuga Lake. It spreads over 2,300 acres and comprises laboratories, administrative buildings, and almost all the campus' academic buildings, athletic facilities, auditoriums, and museums. The architecture is an eclectic mix of Collegiate Gothic, Victorian, and Neoclassical buildings, international and modernist structures. There are other campuses and facilities in New York City itself such as the medical campus Weill Cornell in Manhattan, and the engineering campus Cornell Tech. Outside New York, Cornell has an outpost in the gulf state of Qatar, which is the first American medical college to open outside of the United States. Ithaca campus sits at the heart of the Finger Lakes region, surrounded by green space and natural beauty. Students here are as likely to be found sitting under a tree with their nose in a book as they are taking advantage of the many clubs, societies and activities Cornell has to offer. First-year undergraduates live on North Campus, while upper-level students often hone in on the communities that they have found, opting for a fraternity or sorority, a co-op, a themed residence hall, or an apartment off campus. There are more than 1,000 organizations on campus, ranging from skateboarding to volunteer programs. Sporty or outdoorsy students can take part in courses as diverse as caving and rope climbing, and there are four sports centers for the fitness inclined. Food lovers are also well catered for, with Cornell voted in the top ten universities for food, with more than 30 dining facilities across campus. ","20":"COVID-19 Information:The University of Hong Kong has moved as much of its activities online as possible, although the library remains open for students, albeit on a restricted basis. It is continuing to monitor how the situation will affect university applications.\n\n The University of Hong Kong (HKU), is Hong Kong’s oldest tertiary institution, with a history stretching back over a hundred years. The University of Hong Kong is ranked 26th amongst the most respected comprehensive research-led universities in the world.An Academic Powerhouse\nApart from being the 26th best university overall globally, HKU has 6 subjects placed amongst Top 10 worldwide, while HKU Dentistry programme was ranked 1st in the world for the second consecutive years.  \n\nHKU's exceptional academic standards and pioneering research attract many top-performing scholars in Hong Kong, Mainland China and overseas. Studying at HKU, you will have a chance to meet and learn with some of the world’s top scholars.\n\n A Globally Connected Campus\nAt HKU, you will meet students from 96 countries and learn from some of the best professors in the world, amongst which 60% are from outside Hong Kong. You get the opportunity to have a life experience abroad during your studies at HKU. In 2015, more than 4,000 HKU undergraduate students have gone on either one semester or one year's student exchange programme at our partner universities, or have participated in service learning projects, field trips, undergraduate research programme or internships in overseas. With HKU as your base, you get to go to places like Cambridge, MIT or Harvard to Myanmar, or South Africa to further expand your horizons!A Degree that Opens Doors\nFor the last 11 years, more than 99.4% of our graduates have received at least one job offer in every consecutive academic year, with many embarking on careers in fields as diverse as finance, law, engineering and technology, and working at international corporate including the likes of Apple, Google and Goldman Sachs.\n\n There is a whole lot more to HKU. To find out more about the educational adventures awaiting you in one of the world’s most exciting cities and leading universities, just spend some time on our admissions website.","21":"COVID-19 Information:The Columbia University Visitors Center is closed until further notice. Classes are planned to continue virtually for the upcoming term. International students have been reassured that taking online classes does not affect their visa status.Established in 1754, Columbia University is a private Ivy League research university in Upper Manhattan, New York City. It was established as King's College by royal charter of George II of Great Britain and renamed Columbia College in 1784 following the American Revolutionary War. With an undergraduate acceptance rate of 5.8 percent, Columbia is currently the third most selective college in the United States and the second most selective in the Ivy League after Harvard. Its first president was none other than the literary great Samuel Johnson, and over the years Columbia has produced numerous distinguished alumni, from Oscar winners and Nobel laureates to Supreme Court judges. Three US Presidents and the authors of the Declaration of Independence and American Constitution were also schooled at Columbia. It also runs the highly distinguished Pulitzer Prize, an annual award for achievements in journalism, literature and musical composition. The university is organized into 20 schools, including undergraduate schools such as Columbia College, the Fu Foundation School of Engineering and Applied Science, and the School of General Studies, as well as graduate schools such as Columbia Law School, Columbia College of Physicians and Surgeons, Columbia Journalism School and Columbia Business School. It also had global research outposts across the world. Its total student body numbers around 28,000 and is comprised mainly of postgraduates, with roughly 8,500 undergraduate students. Columbia’s main campus is Morningside Heights, occupying around six city blocks in the Morningside Heights district of New York. It’s home to the neo-classical Butler library, one of the largest buildings on campus, and almost two dozen undergraduate dormitories. The university also owns 7,800 apartments in the local area, which house faculty members, students, and staff. The campus was designed along Beaux-Arts principles and was a late 19th century vision of a campus where all disciplines could be taught. Some of its standout features include the Low Memorial Library, a National Historic Landmark, the site of the invention of FM radio, and the location where the nuclear fission of uranium first took place. More significant for students are The Steps, a long series of granite steps which are a popular hangout and meeting place, and the bronze figure of Alma Mater, a female figure draped in an academic gown who serves as a daily reminder to students of their scholarly duties. ","22":"COVID-19 Information:Any students with questions about their enrolment at the University of Tokyo are advised to contact the relevant faculty\/graduate school\/institute.Established in 1877 as the first imperial university, the University of Tokyo is one of Japan’s most storied and prestigious higher education establishments. In 2011, the university, which is nicknamed Todai, was ranked second in the world behind Harvard for the number of alumni in CEO positions at Fortune 500 companies. Also, 15 of Japan’s 62 prime ministers were educated at the University of Tokyo, and five alumni have gone on to become astronauts. Tokyo consists of 10 faculties and 15 graduate schools, and has 30,000 students enrolled, of which 2,100 are from overseas. Unusually for a Japanese university, it also runs undergraduate programs taught entirely in English: the International Program on Japan in East Asia and the International Program on Environmental Sciences. In 2014, the university’s School of Science introduced an all-English undergraduate transfer program called Global Science Course. Todai has five campuses, in the districts of Hongō, Komaba, Kashiwa, Shirokane and Nakano. Tokyo is a vibrant metropolis with a distinct urban character and unique culture that is ideal for growing minds and youthful adventure. The main Hongo campus occupies the former estate of the Maeda family, once the feudal lords of Kaga Province. It therefore attracts tourists due to landmarks such as Akamon (the Red Gate) and the majestic Yasuda Auditorium. It’s also where UTokyo’s annual May festival is held. The other campuses have more modern features. Komaba campus ¬– home to the College of Arts and Sciences, the Graduate School of Arts and Sciences, and the Graduate School of Mathematical Sciences – is home to 7,000 freshmen and sophomores. The undergraduate experience at the University of Tokyo is unique as it’s the only Japanese university with a system of two years of general education before students choose their major. The campus has been designated a \"center of excellence\" for three new areas of research by Japan’s Ministry of Education and Science. ","23":"COVID-19 Information:All events until April 12 for applicants to Johns Hopkins University have now been cancelled. This includes campus tours and admissions events. Classes are being taught remotely.\nThe university has also suspended all new international exchange and domestic visitors to Johns Hopkins, including visiting students, faculty, and scholars.Johns Hopkins University is an American private research university in Baltimore, Maryland. It was founded in 1876, and named after its first benefactor, the American entrepreneur, abolitionist, and philanthropist Johns Hopkins. It blazed a trail among higher education institutions by being the first US research university, and today it puts more money into research than any other US academic institution. It’s also widely credited with revolutionizing higher education by being the first US institution to integrate teaching and research. To date, Johns Hopkins has spawned 27 Nobel laureates, including the former US president Woodrow Wilson. Johns Hopkins is organized into 10 divisions on campuses in Maryland and Washington, DC with international centers in Italy, China, and Singapore. Johns Hopkins regularly ranks in the top 10 universities in the US, and is also competitive globally, especially for its undergraduate programs. Johns Hopkins enrolls more than 24,000 full- and part-time students across its nine academic divisions with faculty members and students studying, teaching, and learning across more than 260 programs in the arts and music, the humanities, the social and natural sciences, engineering, international studies, education, business, and the health professions. Applicants at undergraduate level are generally ranked in the top 10 percent of their high school class, and over time applications and selectivity has risen. For the class graduating in 2020, the acceptance rate was 11.4 percent. Most Johns Hopkins undergraduates study at Homewood, a 140-acre North Baltimore campus that is home to the schools of engineering and arts and sciences. It’s a traditional college setting in the heart of a big and blossoming city, with red-brick buildings, tree-lined pathways, an iconic clock tower, and expansive green quads. Nearly all undergraduates based in the main campus live in residence halls during their first two years, where they make friends and take advantage of what has officially been named one of the best campus dining programs in the US. There’s also easy access to top class arts and culture: the school’s conservatory, the Peabody Institute, regularly hosts musical extravaganzas, concerts and performances, while the Center for Visual Arts, located next to the Baltimore Museum of Art, provides plenty of sources for artistic inspiration.Off-campus, students can venture into Baltimore itself, a city with a rich history as a working-class port that has blossomed into a hub of social, cultural, and economic activity – yet retains a small-town feel. ","24":"COVID-19 Information.Classes are currently being offered in alternative formats and many are offered online only. Most exams take place remotely, as well. All face-to-face on-campus and off-campus admissions events have been cancelled until further notice and campus visits are strongly discouraged. See https:\/\/admissions.umich.edu\/apply\/first-year-applicants\/requirements-deadlines\/application-changes for the latest new about the undergraduate application process.The description below is accurate, although some practices may have changed temporarily during the pandemic.One of the foremost research universities in the United States, the University of Michigan was founded in 1817, before Michigan had even become a state, and moved from Detroit to what is now its Central campus in Ann Arbor in 1837. Michigan spans 780 acres, which is made up of its Central and North campuses, two regional campuses, and a center in Detroit. It has a large student body of around 46,000, with undergraduates numbering two-thirds of that number. Michigan has been lauded for having high standards of research, and the university’s comprehensive graduate program offers doctoral degrees in the humanities, social sciences, and STEM fields (science, technology, engineering and mathematics) as well as professional degrees in architecture, business, medicine, law, pharmacy, nursing, social work, public health, and dentistry.Michigan's body of living alumni comprises more than a half million people, which is one of the largest alumni bases of any university in the world and a valuable resource for current students when it comes to networking and building industry connections.Around a quarter of all students are accommodated on campus, with many residence halls serving undergraduates, and family housing that is intended mainly for graduate students. There are also off-campus apartments, houses, and co-operatives, which generally house upper division and graduate students, as well as ‘theme communities’ within residence halls, where students can immerse themselves among peers with similar interests. Michigan has more than 1,600 clubs and societies, including engineering project teams, community service organizations, and charitable projects. The Michigan Marching Band is over 100 years old and has 350 student members, and other noted musical ensembles include the University of Michigan Men’s Glee Club, a men’s chorus with over 100 members. Michigan has a history of student activism, and there are a number of groups dedicated to various worth causes. Some, such as the United Students Against Sweatshops (USAS), devote themselves to more left-wing causes, in this case holding to account multinational companies that exploit their workers in factories, but there are also conservative groups such as Young Americans for Freedom, as well as non-partisan groups. Cultural and ethnical student organizations help students forge smaller communities from the large university population, and publications such as the Michigan Daily, published five days a week during the Fall and Winter terms, allow students to keep abreast of the latest news on campus. ","25":"Located in the heart of Paris, PSL inspires dialog among and between all areas of knowledge, innovation, and creativity. With 17,000 students and 2,900 researchers, it is a human-scale university.PSL includes 9 Component Schools and 2 Associate Members and works closely with 3 research entities. It draws on the scientific strengths of all its schools to foster unprecedented opportunities for its communities in education, research, technology transfer, and industrial and academic partnerships both nationally and internationally.With 28 Nobel laureates, 10 Fields medal winners, 3 Abel laureates, 50 César, and 79 Molière awardees, it represents circa 10% of French research and has received more than 150 ERC grants since its creation. Its academic community draws from the full potential of PSL’s 140 laboratories, to offer students and researchers a range of interdisciplinary graduate programs, in all scientific fields.Chosen from around the world for their talent and carefully supervised, PSL students have access to a comprehensive research-based course offering. Whether they become researchers, entrepreneurs, managers or artists, PSL students learn to formulate answers and solutions that will have an impact on our society. PSL is a public university that promotes a diverse student body, welcoming students from every social status, gender, and geographical origin.\n As a major hub of arts and culture, PSL hosts many debates, lectures, exhibits, shows, and concerts throughout the year. It forms strategic partnerships with the world’s top universities. A leader in innovation, PSL supports applications of its research by creating some 50 start-ups and filing nearly 70 patents annually. In 2017 it launched its own seed fund, the PSL Innovation Fund.Université PSL : Conservatoire National Supérieur d'Art dramatique - PSL, Dauphine - PSL, École nationale des chartes - PSL, École nationale supérieure de Chimie de Paris - PSL, École normale supérieure - PSL, École Pratique des Hautes Études - PSL, ESPCI Paris - PSL, Mines Paris - PSL, Observatoire de Paris - PSL, Collège de France, Institut Curie.\nPartners : Conservatoire national supérieur de Musique et de Danse de Paris, École française d'Extrême-Orient, Ecole nationale d’administration, École nationale supérieure d’architecture Paris – Malaquais, École nationale supérieure des Arts Décoratifs, Beaux-Arts de Paris, Institut Louis Bachelier, La Fémis, Lycée Henri-IV.\nWith the support of : CNRS, Inserm, Inria.","26":"Founded in 1868, the University of California, Berkeley (UCB) is a public research university and the flagship institution of the ten research universities affiliated with the University of California system. Berkeley is one of the 14 founding members of the Association of American Universities and is home to some world-renowned research institutes, including the Mathematical Sciences Research Institute and the Space Sciences Laboratory. Berkeley alumni, faculty and researchers include 99 Nobel laureates, 23 Turing Award winners, and 14 Pulitzer Prize winners. Faculty member J. R. Oppenheimer led the Manhattan project to create the first atomic bomb, while Berkeley’s Nobel laureate Ernest Lawrence invented the cyclotron, through which UC Berkeley scientists and researchers discovered 16 chemical elements of the periodic table.Berkeley started out with little more than 40 students but, as the first full-curriculum university in California, it quickly gained ground on its illustrious forebears. By the early 1940s, it had grown substantially and was ranked second only to Harvard. During this decade, Berkeley gained further prestige through its radiation laboratory, which was instrumental in the project to develop an atomic bomb.  During the sixties, Berkeley gained a worldwide reputation for student activism, thanks to the Free Speech Movement of 1964 and campus opposition to the Vietnam War. In 1969, the then governor of California Ronald Reagan called the Berkeley campus \\\"a haven for communist sympathizers, protesters, and sex deviants,\\\" though today’s students tend to be more politically moderate. The Berkeley campus encompasses approximately 1,232 acres of the bay area of San Francisco, with many of its Beaux-Arts-style buildings recognized as California Historical Landmarks. Three quarters of its 40,000 students are undergraduates, giving life on campus a youthful feel in vibrant, urban surrounds. Most undergraduate students live in residential halls, where they can make friends, work and play in a safe environment designed to enhance the academic experience through a culture of care. There are also student co-ops and not-for-profit housing cooperatives for Berkeley students, with over 1,300 students living in 17 houses and three apartment cooperatives around the Berkeley campus. Students can play sports, and join clubs and societies spanning every imaginable interest. On campus, students can visit the Lawrence Hall of Science, watch sport at the newly-renovated California Memorial Stadium, take in a noon concert, or stroll through Sproul Plaza, the social heart of Berkeley campus.","27":"COVID-19 Information: https:\/\/www.manchester.ac.uk\/coronavirus\/For more information, check the applicants and offer-holders tab.The University of Manchester offers over 1,000 degree programmes across the humanities, business, science, and engineering subject areas. These programmes include foundation courses, bachelor's degrees, master's degrees, PhDs and MBAs.Ranked 27th in the world according to the QS World University Rankings® 2021, the University of Manchester is a prestigious red brick university and is also a member of the Russell Group: a select network of leading research-intensive universities in the UK. The University is investing £1 billion over 10 years into its campus and facilities, helping to sustain its incredible history of innovation, with 25 Nobel Prize winners among its current and former students and staff. The University helped with the development of the world's first modern computer in 1948, and was where Ernest Rutherford first split the atom in 1917.Today, The University of Manchester is at the forefront of cutting edge research in science and engineering, particularly into new treatments for life-threatening diseases. In 2015\/2016 alone, the University of Manchester attracted over £342 million in external research funding.Recruiters target University of Manchester graduates because they’re highly employable. Ranked 35th in the QS Graduate Employability Rankings 2017, it boasts a 94% employability rate.\nMaking up 25% of the student population, The University of Manchester has the highest percentage of international students in the UK; as many as 180 nationalities are represented on campus. The university offers a number of postgraduate scholarships to international students - find out about any opportunity you may be eligible for here.Follow the University of Manchester on Facebook, Instagram, LinkedIn and Twitter.","28":"As a world-class university that proudly represents the Republic of Korea, Seoul National University has paved the way for the future as Korea’s most prestigious national institution for higher education. Founded as the first comprehensive university in 1946 by the merger of ten higher education institutions, SNU is now experiencing happier times than ever, with 28,000 students enrolled in undergraduate and postgraduate programs. Fifteen colleges offer 85 undergraduate academic programs, under which students can also choose to study interdisciplinary or double major programs. At the postgraduate level, the graduate school offers 106 master’s programs and 107 doctoral programs across five fields of study. There are twelve professional graduate schools including the Graduate School of Public Health and Graduate School of Convergence Science and Technology that aim to cultivate professionals who address pressing challenges and bring about innovations. There are more than 250 university-wide student exchange partners in 45 countries, including the University of Pennsylvania and the University of California (system). SNU has four campuses: The main Gwanak campus is located in southern Seoul, while the Yeongeon medical campus is situated in the northeast part of the city with colleges of medicine, dentistry, and nursing and SNU Hospital. Outside Seoul, the Pyeongchang green-bio campus in the host city of the Winter Olympics serves as an academic hub for agriculture and life sciences research. Most recently, the Siheung campus has started its functions to cultivate world-class research excellence by launching various industry-academia collaborative R&D centers.At SNU, students, faculty, and any other members will live, work, and socialize as much as they desire. The largest university library in Korea owns a collection of more than 5 million volumes and is equipped with a number of comfortable reading (studying) rooms, IT facilities, multimedia plazas, a theatre, computer labs, and group study rooms. There are various types of education\/research support programs and Korean language programs for international students. All campuses have student dormitories with en-suite bathrooms and useful facilities, and free campus shuttles connect everywhere on campus and even outside the campus. Plenty of cafeterias and snack bars, including a vegetarian cafeteria, and a wide range of student clubs and societies will meet student needs and interests. The on-campus health service center runs a comprehensive primary care clinic and various specialty clinics in cooperation with SNU Hospital and SNU Dental Hospital and provides a range of health checkup programs, immunizations, and medical tests. It also offers multiple therapeutic programs to address mental health issues with SNU Center for Campus Life & Culture. Various sporting activities, whether competitive or recreational, keep students in good shape mentally and physically and a modern art museum and concert halls give a pleasant experience to campus visitors, as well as SNU members.","29":"Renowned for its exceptional teaching, research and small classes, Australian National University (ANU) is ranked by QS as the #1 university in Australia.* It has the highest number of Nobel laureates among its staff and alumni than any other university in the country.ANU has led the development of Australia’s understanding of itself and the world since 1946. The university offers undergraduate and postgraduate students from across Australia and around the world a comprehensive portfolio of degrees – including flexible double degrees – and the support of more than 3,000 academic and professional staff.ANU research informs students’ learning and is rated above world-standard.^ It addresses the important issues of today’s complex world, such as biodiversity, climate change, energy alternatives, food and regional security. Other research areas include combating disease, justice and the law, physics, engineering, humanities and the arts.The main campus is in the heart of the national capital, Canberra. A meeting place for First Nations Ngunnawal and Ngambri people for thousands of years, Canberra is a global and diverse city buzzing with year-round festivals and world-class arts, culture and entertainment. Fresh air, mountains, bike paths and the locals’ commitment to sustainability make the capital the world’s 5th healthiest city to live in.^^ANU is a member of the Group of Eight – and the only Australian member of the International Alliance of Research Universities.* QS World University Rankings 2022^ Excellence in Research for Australia report 2019^^ Money.co.uk survey report 2021"}}